from django.core.management.base import BaseCommand
from apps.catalog.models import cities, car_types, car_delivery_prices
from django.db import transaction

class Command(BaseCommand):
    help = "Заполняет таблицы начальными данными"

    def handle(self, *args, **options):
        data = {
    "Иркутск": {
        "Кей-кар": 80000,
        "Седан": 85000,
        "Кроссовер": 90000,
        "Минивэн": 95000,
        "Джип": 100000,
    },
    "Красноярск": {
        "Кей-кар": 115000,
        "Седан": 120000,
        "Кроссовер": 125000,
        "Минивэн": 130000,
        "Джип": 13500
    },
    "Новосибирск": {
        "Кей-кар": 115000,
        "Седан": 120000,
        "Кроссовер": 125000,
        "Минивэн": 130000,
        "Джип": 135000
    },
    "Омск": {
        "Кей-кар": 125000,
        "Седан": 130000,
        "Кроссовер": 135000,
        "Минивэн": 145000,
        "Джип": 150000
    },
    "Челябинск": {
        "Кей-кар": 145000,
        "Седан": 150000,
        "Кроссовер": 155000,
        "Минивэн": 155000,
        "Джип": 160000
    },
    "Тюмень": {
        "Кей-кар": 145000,
        "Седан": 150000,
        "Кроссовер": 155000,
        "Минивэн": 155000,
        "Джип": 160000
    },
    "Екатеринбург": {
        "Кей-кар": 145000,
        "Седан": 150000,
        "Кроссовер": 155000,
        "Минивэн": 155000,
        "Джип": 160000
    },
    "Уфа": {
        "Кей-кар": 145000,
        "Седан": 150000,
        "Кроссовер": 155000,
        "Минивэн": 155000,
        "Джип": 160000
    },
    "Тольятти": {
        "Кей-кар": 150000,
        "Седан": 155000,
        "Кроссовер": 160000,
        "Минивэн": 160000,
        "Джип": 165000
    },
    "Самара": {
        "Кей-кар": 150000,
        "Седан": 155000,
        "Кроссовер": 160000,
        "Минивэн": 160000,
        "Джип": 165000
    },
    "Ижевск": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Москва": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Набережные Челны": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Пермь": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Казань": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Чебоксары": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Нижний Новгород": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Владимир": {
        "Кей-кар": 160000,
        "Седан": 170000,
        "Кроссовер": 175000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Пенза": {
        "Кей-кар": 165000,
        "Седан": 175000,
        "Кроссовер": 180000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Ульяновск": {
        "Кей-кар": 165000,
        "Седан": 175000,
        "Кроссовер": 180000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Киров": {
        "Кей-кар": 165000,
        "Седан": 175000,
        "Кроссовер": 180000,
        "Минивэн": 180000,
        "Джип": 185000
    },
    "Санкт-Петербург": {
        "Кей-кар": 180000,
        "Седан": 190000,
        "Кроссовер": 195000,
        "Минивэн": 195000,
        "Джип": 200000
    },
    "Воронеж": {
        "Кей-кар": 170000,
        "Седан": 180000,
        "Кроссовер": 190000,
        "Минивэн": 200000,
        "Джип": 205000
    },
    "Саратов": {
        "Кей-кар": 170000,
        "Седан": 180000,
        "Кроссовер": 190000,
        "Минивэн": 200000,
        "Джип": 205000
    },
    "Ростов-на-Дону": {
        "Кей-кар": 170000,
        "Седан": 180000,
        "Кроссовер": 190000,
        "Минивэн": 200000,
        "Джип": 205000
    },
    "Волгоград": {
        "Кей-кар": 170000,
        "Седан": 180000,
        "Кроссовер": 190000,
        "Минивэн": 200000,
        "Джип": 205000
    },
    "Краснодар": {
        "Кей-кар": 170000,
        "Седан": 180000,
        "Кроссовер": 190000,
        "Минивэн": 200000,
        "Джип": 205000
    }
}

        body_type_codes = {
            "Кей-кар": "key-car",
            "Седан": "sedan",
            "Кроссовер": "crossover",
            "Джип": "jeep",
            "Минивэн": "minibus",
        }
        
        for city_name, values in data.items():
            city_obj, _ = cities.objects.get_or_create(
                city_name=city_name
                # defaults={
                #     'distance_from_vladivostok': values["Расстояние от Владивостока, км"],
                #     'delivery_time_days': values["Время в пути, ДО, в сутках"]
                # }
            )

            for ru_body, price in values.items():
                if ru_body in body_type_codes:
                    code = body_type_codes[ru_body]

                    car_type_obj, _ = car_types.objects.get_or_create(
                        car_types_name=ru_body,
                        body_type=code
                    )

                    car_delivery_prices.objects.get_or_create(
                        city_id=city_obj,
                        car_type_id=car_type_obj,
                        defaults={'price': price}
                    )